src/DataProcessors/ЗакрытиеЗаказовПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗакрытиеЗаказовПоставщику</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазмерПакета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗаявкиПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкиПокупателей</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Отказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/DataProcessors/ЗакрытиеЗаказовПоставщику/Ext/ObjectModule.bsl
Процедура ВыполнитьРегламентноеЗадание() Экспорт
	//Заявки	
	РезультатЗапроса  = ЗапросЗаявокКЗакрытию();
	Если не РезультатЗапроса.Пустой() тогда 
		
		Выборка = РезультатЗапроса.выбрать();
		УстановитьСтатусВыборки(Выборка,Справочники.СтатусыДокументов.ЗаявкаПокупателяЗакрыт);
	КонецЕсли;
	
	РезультатЗапроса  = ЗапросНеВерноЗакрытыхЗаявок();
	Если не РезультатЗапроса.Пустой() тогда 
		
		Выборка = РезультатЗапроса.выбрать();
		УстановитьСтатусВыборки(Выборка,Справочники.СтатусыДокументов.ЗаявкаПокупателяПодтвержден);
	КонецЕсли;

	
	//Заказы	
	ВыборкаНезакрытых = ВыбратьНеЗакрытыеЗаказы();
	если НЕ ВыборкаНезакрытых = Неопределено тогда 
		УстановитьСтатусВыборки(ВыборкаНезакрытых,Справочники.СтатусыДокументов.ЗаказПоставщикуЗакрыт);	
	КонецЕсли;
	
	ВыборкаНеправильныхЗакрытий = ВыбратьНеВерноЗакрытыеЗаказы();
	если НЕ ВыборкаНеправильныхЗакрытий = Неопределено тогда 
		УстановитьСтатусВыборки(ВыборкаНеправильныхЗакрытий,Справочники.СтатусыДокументов.ОтгруженПоставщиком);	
	КонецЕсли;

	
КонецПроцедуры

ПРоцедура УстановитьСтатусВыборки(ВыборкаНезакрытых,Статус)
	Пока ВыборкаНезакрытых.Следующий() цикл
		Попытка 
		Документ = ВыборкаНезакрытых.ДокументСсылка.ПолучитьОбъект();
		документ.СтатусДокумента =  Статус;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(документ,Истина);	
		Если ТипЗнч(ВыборкаНезакрытых.ДокументСсылка) = тип("ДокументСсылка.ЗаказПоставщику") тогда 		
		ОбменДаннымиКлиентСервер.ЗарегистрироватьИзмененияВПланеОбмена(ОбменССайтомСервер.УзелПланаОбмена("ОбменПартКом83_ОкноПоставщика",Ложь),Документ)
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;	
	
	
КонецПроцедуры

#Область Заказы


Функция ВыбратьНеЗакрытыеЗаказы()
	ЗапросНезакрытых = Новый Запрос ;
	 текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ %1
	          |	ЗаказыПоставщикам.Регистратор КАК ДокументСсылка,
	          |	МАКСИМУМ(ЗаказыПоставщикамОстатки.СтрокаЗаявки) КАК СтрокаЗаявки
	          |ИЗ
	          |	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
	          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
	          |		ПО ЗаказыПоставщикам.СтрокаЗаявки = ЗаказыПоставщикамОстатки.СтрокаЗаявки
	          |			И (ЗаказыПоставщикамОстатки.КоличествоОстаток > 0)
	          |ГДЕ
	          |	ЗаказыПоставщикам.Регистратор ССЫЛКА Документ.ЗаказПоставщику
	          |	И (ВЫРАЗИТЬ(ЗаказыПоставщикам.Регистратор КАК Документ.ЗаказПоставщику).СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ОбработанПоставщиком)
	          |			ИЛИ ВЫРАЗИТЬ(ЗаказыПоставщикам.Регистратор КАК Документ.ЗаказПоставщику).СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ОтгруженПоставщиком)
	          |			ИЛИ ВЫРАЗИТЬ(ЗаказыПоставщикам.Регистратор КАК Документ.ЗаказПоставщику).СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПолученОтветПоставщика)
	          |			ИЛИ ВЫРАЗИТЬ(ЗаказыПоставщикам.Регистратор КАК Документ.ЗаказПоставщику).СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПринятОтПоставщика))
	          |
	          |СГРУППИРОВАТЬ ПО
	          |	ЗаказыПоставщикам.Регистратор
	          |
	          |ИМЕЮЩИЕ
	          |	МАКСИМУМ(ЗаказыПоставщикамОстатки.СтрокаЗаявки) ЕСТЬ NULL";
	
	ЗапросНезакрытых.Текст =   СтрШаблон(Текст,
	?(ЗначениеЗаполнено(РазмерПакета)," ПЕРВЫЕ "+ Формат(РазмерПакета,"ЧГ=0"),"")
	);
	
	Результат = ЗапросНезакрытых.выполнить();
	если Результат.Пустой() тогда 
		возврат Неопределено;
	иначе 
		возврат  Результат.Выбрать();
	КонецЕсли;	
	
КонецФункции	

Функция ВыбратьНеВерноЗакрытыеЗаказы()
	
	ЗапросНезакрытых = Новый Запрос ;
	 текст =  "ВЫБРАТЬ РАЗЛИЧНЫЕ %1
	          |	ЗаказыПоставщикам.Регистратор КАК ДокументСсылка,
	          |	МАКСИМУМ(ЗаказыПоставщикамОстатки.СтрокаЗаявки) КАК СтрокаЗаявки
	          |ИЗ
	          |	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
	          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
	          |		ПО ЗаказыПоставщикам.СтрокаЗаявки = ЗаказыПоставщикамОстатки.СтрокаЗаявки
	          |			И (ЗаказыПоставщикамОстатки.КоличествоОстаток > 0)
	          |ГДЕ
	          |	ЗаказыПоставщикам.Регистратор ССЫЛКА Документ.ЗаказПоставщику
	          |	И ВЫРАЗИТЬ(ЗаказыПоставщикам.Регистратор КАК Документ.ЗаказПоставщику).СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЗаказПоставщикуЗакрыт)
	          |
	          |СГРУППИРОВАТЬ ПО
	          |	ЗаказыПоставщикам.Регистратор
	          |
	          |ИМЕЮЩИЕ
	          |	НЕ МАКСИМУМ(ЗаказыПоставщикамОстатки.СтрокаЗаявки) ЕСТЬ NULL";
	
	ЗапросНезакрытых.Текст =   СтрШаблон(Текст,
	?(ЗначениеЗаполнено(РазмерПакета)," ПЕРВЫЕ "+ Формат(РазмерПакета,"ЧГ=0"),"")
	);
	
	Результат = ЗапросНезакрытых.выполнить();
	если Результат.Пустой() тогда 
		возврат Неопределено;
	иначе 
		возврат  Результат.Выбрать();
	КонецЕсли;	

КонецФункции	
	


#Конецобласти

#Область ЗАявки


Функция ЗапросЗаявокКЗакрытию()
	Запрос = новый Запрос;
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ %1
	        |	ЗаявкиПокупателей.Регистратор КАК ДокументСсылка,
	        |	МАКСИМУМ(ЗаявкиПокупателейОстатки.СтрокаЗаявки) КАК СтрокаЗаявки
	        |ИЗ
	        |	РегистрНакопления.ЗаявкиПокупателей КАК ЗаявкиПокупателей
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаявкиПокупателей.Остатки КАК ЗаявкиПокупателейОстатки
	        |		ПО ЗаявкиПокупателей.СтрокаЗаявки = ЗаявкиПокупателейОстатки.СтрокаЗаявки
	        |ГДЕ
	        |	ЗаявкиПокупателей.Регистратор ССЫЛКА Документ.ЗаявкаПокупателя
	        |	И ВЫРАЗИТЬ(ЗаявкиПокупателей.Регистратор КАК Документ.ЗаявкаПокупателя).СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЗаявкаПокупателяПодтвержден)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаявкиПокупателей.Регистратор
	        |
	        |ИМЕЮЩИЕ
	        |	МАКСИМУМ(ЗаявкиПокупателейОстатки.СтрокаЗаявки) ЕСТЬ NULL";
	Запрос.Текст = СтрШаблон(Текст,
	?(ЗначениеЗаполнено(РазмерПакета)," ПЕРВЫЕ "+ Формат(РазмерПакета,"ЧГ=0") +" " ,"")
	);
	Возврат Запрос.Выполнить();
	
	
КонецФункции	

Функция ЗапросНеВерноЗакрытыхЗаявок()
	Запрос = новый Запрос;
	Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ  %1
	        |	ЗаявкиПокупателей.Регистратор КАК ДокументСсылка,
	        |	МАКСИМУМ(ЗаявкиПокупателейОстатки.СтрокаЗаявки) КАК СтрокаЗаявки
	        |ИЗ
	        |	РегистрНакопления.ЗаявкиПокупателей КАК ЗаявкиПокупателей
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаявкиПокупателей.Остатки КАК ЗаявкиПокупателейОстатки
	        |		ПО ЗаявкиПокупателей.СтрокаЗаявки = ЗаявкиПокупателейОстатки.СтрокаЗаявки
	        |ГДЕ
	        |	ЗаявкиПокупателей.Регистратор ССЫЛКА Документ.ЗаявкаПокупателя
	        |	И ВЫРАЗИТЬ(ЗаявкиПокупателей.Регистратор КАК Документ.ЗаявкаПокупателя).СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЗаявкаПокупателяЗакрыт)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаявкиПокупателей.Регистратор
	        |
	        |ИМЕЮЩИЕ
	        |	НЕ МАКСИМУМ(ЗаявкиПокупателейОстатки.СтрокаЗаявки) ЕСТЬ NULL";
	Запрос.Текст = СтрШаблон(Текст,
	?(ЗначениеЗаполнено(РазмерПакета)," ПЕРВЫЕ "+ Формат(РазмерПакета,"ЧГ=0") +" " ,"")
	);
	Возврат Запрос.Выполнить();
	
	
	
КонецФункции	
#Конецобласти
